SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG23/Include/efr32fg23_eca.h
/* Bit fields for ECA STARTTRIGFEDMASK */
#define _ECA_STARTTRIGFEDMASK_RESETVALUE               0x00000000UL                                 /**< Default value for ECA_STARTTRIGFEDMASK      */
#define _ECA_STARTTRIGFEDMASK_MASK                     0xFFFFFFFFUL                                 /**< Mask for ECA_STARTTRIGFEDMASK               */
#define _ECA_STARTTRIGFEDMASK_FEDMASK_SHIFT            0                                            /**< Shift value for ECA_FEDMASK                 */
#define _ECA_STARTTRIGFEDMASK_FEDMASK_MASK             0xFFFFFFFFUL                                 /**< Bit mask for ECA_FEDMASK                    */
#define _ECA_STARTTRIGFEDMASK_FEDMASK_DEFAULT          0x00000000UL                                 /**< Mode DEFAULT for ECA_STARTTRIGFEDMASK       */
#define ECA_STARTTRIGFEDMASK_FEDMASK_DEFAULT           (_ECA_STARTTRIGFEDMASK_FEDMASK_DEFAULT << 0) /**< Shifted mode DEFAULT for ECA_STARTTRIGFEDMASK*/

/* Bit fields for ECA STARTTRIGLVL0MASK */
#define _ECA_STARTTRIGLVL0MASK_RESETVALUE              0x00000000UL                                   /**< Default value for ECA_STARTTRIGLVL0MASK     */
#define _ECA_STARTTRIGLVL0MASK_MASK                    0xFFFFFFFFUL                                   /**< Mask for ECA_STARTTRIGLVL0MASK              */
#define _ECA_STARTTRIGLVL0MASK_LVL0MASK_SHIFT          0                                              /**< Shift value for ECA_LVL0MASK                */
#define _ECA_STARTTRIGLVL0MASK_LVL0MASK_MASK           0xFFFFFFFFUL                                   /**< Bit mask for ECA_LVL0MASK                   */
#define _ECA_STARTTRIGLVL0MASK_LVL0MASK_DEFAULT        0x00000000UL                                   /**< Mode DEFAULT for ECA_STARTTRIGLVL0MASK      */
#define ECA_STARTTRIGLVL0MASK_LVL0MASK_DEFAULT         (_ECA_STARTTRIGLVL0MASK_LVL0MASK_DEFAULT << 0) /**< Shifted mode DEFAULT for ECA_STARTTRIGLVL0MASK*/

/* Bit fields for ECA STARTTRIGLVL1MASK */
#define _ECA_STARTTRIGLVL1MASK_RESETVALUE              0x00000000UL                                   /**< Default value for ECA_STARTTRIGLVL1MASK     */
#define _ECA_STARTTRIGLVL1MASK_MASK                    0xFFFFFFFFUL                                   /**< Mask for ECA_STARTTRIGLVL1MASK              */
#define _ECA_STARTTRIGLVL1MASK_LVL1MASK_SHIFT          0                                              /**< Shift value for ECA_LVL1MASK                */
#define _ECA_STARTTRIGLVL1MASK_LVL1MASK_MASK           0xFFFFFFFFUL                                   /**< Bit mask for ECA_LVL1MASK                   */
#define _ECA_STARTTRIGLVL1MASK_LVL1MASK_DEFAULT        0x00000000UL                                   /**< Mode DEFAULT for ECA_STARTTRIGLVL1MASK      */
#define ECA_STARTTRIGLVL1MASK_LVL1MASK_DEFAULT         (_ECA_STARTTRIGLVL1MASK_LVL1MASK_DEFAULT << 0) /**< Shifted mode DEFAULT for ECA_STARTTRIGLVL1MASK*/

/* Bit fields for ECA STOPTRIGENMASK */
#define _ECA_STOPTRIGENMASK_RESETVALUE                 0x00000000UL                              /**< Default value for ECA_STOPTRIGENMASK        */
#define _ECA_STOPTRIGENMASK_MASK                       0xFFFFFFFFUL                              /**< Mask for ECA_STOPTRIGENMASK                 */
#define _ECA_STOPTRIGENMASK_ENMASK_SHIFT               0                                         /**< Shift value for ECA_ENMASK                  */
#define _ECA_STOPTRIGENMASK_ENMASK_MASK                0xFFFFFFFFUL                              /**< Bit mask for ECA_ENMASK                     */
#define _ECA_STOPTRIGENMASK_ENMASK_DEFAULT             0x00000000UL                              /**< Mode DEFAULT for ECA_STOPTRIGENMASK         */
#define ECA_STOPTRIGENMASK_ENMASK_DEFAULT              (_ECA_STOPTRIGENMASK_ENMASK_DEFAULT << 0) /**< Shifted mode DEFAULT for ECA_STOPTRIGENMASK */

/* Bit fields for ECA STOPTRIGREDMASK */
#define _ECA_STOPTRIGREDMASK_RESETVALUE                0x00000000UL                                /**< Default value for ECA_STOPTRIGREDMASK       */
#define _ECA_STOPTRIGREDMASK_MASK                      0xFFFFFFFFUL                                /**< Mask for ECA_STOPTRIGREDMASK                */
#define _ECA_STOPTRIGREDMASK_REDMASK_SHIFT             0                                           /**< Shift value for ECA_REDMASK                 */
#define _ECA_STOPTRIGREDMASK_REDMASK_MASK              0xFFFFFFFFUL                                /**< Bit mask for ECA_REDMASK                    */
#define _ECA_STOPTRIGREDMASK_REDMASK_DEFAULT           0x00000000UL                                /**< Mode DEFAULT for ECA_STOPTRIGREDMASK        */
#define ECA_STOPTRIGREDMASK_REDMASK_DEFAULT            (_ECA_STOPTRIGREDMASK_REDMASK_DEFAULT << 0) /**< Shifted mode DEFAULT for ECA_STOPTRIGREDMASK*/

/* Bit fields for ECA STOPTRIGFEDMASK */
#define _ECA_STOPTRIGFEDMASK_RESETVALUE                0x00000000UL                                /**< Default value for ECA_STOPTRIGFEDMASK       */
#define _ECA_STOPTRIGFEDMASK_MASK                      0xFFFFFFFFUL                                /**< Mask for ECA_STOPTRIGFEDMASK                */
#define _ECA_STOPTRIGFEDMASK_FEDMASK_SHIFT             0                                           /**< Shift value for ECA_FEDMASK                 */
#define _ECA_STOPTRIGFEDMASK_FEDMASK_MASK              0xFFFFFFFFUL                                /**< Bit mask for ECA_FEDMASK                    */
#define _ECA_STOPTRIGFEDMASK_FEDMASK_DEFAULT           0x00000000UL                                /**< Mode DEFAULT for ECA_STOPTRIGFEDMASK        */
#define ECA_STOPTRIGFEDMASK_FEDMASK_DEFAULT            (_ECA_STOPTRIGFEDMASK_FEDMASK_DEFAULT << 0) /**< Shifted mode DEFAULT for ECA_STOPTRIGFEDMASK*/

/* Bit fields for ECA STOPTRIGLVL0MASK */
#define _ECA_STOPTRIGLVL0MASK_RESETVALUE               0x00000000UL                                  /**< Default value for ECA_STOPTRIGLVL0MASK      */
#define _ECA_STOPTRIGLVL0MASK_MASK                     0xFFFFFFFFUL                                  /**< Mask for ECA_STOPTRIGLVL0MASK               */
#define _ECA_STOPTRIGLVL0MASK_LVL0MASK_SHIFT           0                                             /**< Shift value for ECA_LVL0MASK                */
#define _ECA_STOPTRIGLVL0MASK_LVL0MASK_MASK            0xFFFFFFFFUL                                  /**< Bit mask for ECA_LVL0MASK                   */
#define _ECA_STOPTRIGLVL0MASK_LVL0MASK_DEFAULT         0x00000000UL                                  /**< Mode DEFAULT for ECA_STOPTRIGLVL0MASK       */
#define ECA_STOPTRIGLVL0MASK_LVL0MASK_DEFAULT          (_ECA_STOPTRIGLVL0MASK_LVL0MASK_DEFAULT << 0) /**< Shifted mode DEFAULT for ECA_STOPTRIGLVL0MASK*/

/* Bit fields for ECA STOPTRIGLVL1MASK */
#define _ECA_STOPTRIGLVL1MASK_RESETVALUE               0x00000000UL                                  /**< Default value for ECA_STOPTRIGLVL1MASK      */
#define _ECA_STOPTRIGLVL1MASK_MASK                     0xFFFFFFFFUL                                  /**< Mask for ECA_STOPTRIGLVL1MASK               */
#define _ECA_STOPTRIGLVL1MASK_LVL1MASK_SHIFT           0                                             /**< Shift value for ECA_LVL1MASK                */
#define _ECA_STOPTRIGLVL1MASK_LVL1MASK_MASK            0xFFFFFFFFUL                                  /**< Bit mask for ECA_LVL1MASK                   */
#define _ECA_STOPTRIGLVL1MASK_LVL1MASK_DEFAULT         0x00000000UL                                  /**< Mode DEFAULT for ECA_STOPTRIGLVL1MASK       */
#define ECA_STOPTRIGLVL1MASK_LVL1MASK_DEFAULT          (_ECA_STOPTRIGLVL1MASK_LVL1MASK_DEFAULT << 0) /**< Shifted mode DEFAULT for ECA_STOPTRIGLVL1MASK*/

/* Bit fields for ECA CAPTURECTRL */
#define _ECA_CAPTURECTRL_RESETVALUE                    0x00000501UL                                        /**< Default value for ECA_CAPTURECTRL           */
#define _ECA_CAPTURECTRL_MASK                          0x7FF7FFFFUL                                        /**< Mask for ECA_CAPTURECTRL                    */
#define _ECA_CAPTURECTRL_TRACESEL_SHIFT                0                                                   /**< Shift value for ECA_TRACESEL                */
#define _ECA_CAPTURECTRL_TRACESEL_MASK                 0xFFUL                                              /**< Bit mask for ECA_TRACESEL                   */
#define _ECA_CAPTURECTRL_TRACESEL_DEFAULT              0x00000001UL                                        /**< Mode DEFAULT for ECA_CAPTURECTRL            */
#define ECA_CAPTURECTRL_TRACESEL_DEFAULT               (_ECA_CAPTURECTRL_TRACESEL_DEFAULT << 0)            /**< Shifted mode DEFAULT for ECA_CAPTURECTRL    */
#define _ECA_CAPTURECTRL_DATAWIDTH_SHIFT               8                                                   /**< Shift value for ECA_DATAWIDTH               */
#define _ECA_CAPTURECTRL_DATAWIDTH_MASK                0x700UL                                             /**< Bit mask for ECA_DATAWIDTH                  */
#define _ECA_CAPTURECTRL_DATAWIDTH_DEFAULT             0x00000005UL                                        /**< Mode DEFAULT for ECA_CAPTURECTRL            */
#define _ECA_CAPTURECTRL_DATAWIDTH_BIT1                0x00000000UL                                        /**< Mode BIT1 for ECA_CAPTURECTRL               */
#define _ECA_CAPTURECTRL_DATAWIDTH_BIT2                0x00000001UL                                        /**< Mode BIT2 for ECA_CAPTURECTRL               */
#define _ECA_CAPTURECTRL_DATAWIDTH_BIT4                0x00000002UL                                        /**< Mode BIT4 for ECA_CAPTURECTRL               */
#define _ECA_CAPTURECTRL_DATAWIDTH_BIT8                0x00000003UL                                        /**< Mode BIT8 for ECA_CAPTURECTRL               */
#define _ECA_CAPTURECTRL_DATAWIDTH_BIT16               0x00000004UL                                        /**< Mode BIT16 for ECA_CAPTURECTRL              */
#define _ECA_CAPTURECTRL_DATAWIDTH_BIT32               0x00000005UL                                        /**< Mode BIT32 for ECA_CAPTURECTRL              */
#define ECA_CAPTURECTRL_DATAWIDTH_DEFAULT              (_ECA_CAPTURECTRL_DATAWIDTH_DEFAULT << 8)           /**< Shifted mode DEFAULT for ECA_CAPTURECTRL    */
#define ECA_CAPTURECTRL_DATAWIDTH_BIT1                 (_ECA_CAPTURECTRL_DATAWIDTH_BIT1 << 8)              /**< Shifted mode BIT1 for ECA_CAPTURECTRL       */
#define ECA_CAPTURECTRL_DATAWIDTH_BIT2                 (_ECA_CAPTURECTRL_DATAWIDTH_BIT2 << 8)              /**< Shifted mode BIT2 for ECA_CAPTURECTRL       */
#define ECA_CAPTURECTRL_DATAWIDTH_BIT4                 (_ECA_CAPTURECTRL_DATAWIDTH_BIT4 << 8)              /**< Shifted mode BIT4 for ECA_CAPTURECTRL       */
#define ECA_CAPTURECTRL_DATAWIDTH_BIT8                 (_ECA_CAPTURECTRL_DATAWIDTH_BIT8 << 8)              /**< Shifted mode BIT8 for ECA_CAPTURECTRL       */
#define ECA_CAPTURECTRL_DATAWIDTH_BIT16                (_ECA_CAPTURECTRL_DATAWIDTH_BIT16 << 8)             /**< Shifted mode BIT16 for ECA_CAPTURECTRL      */
#define ECA_CAPTURECTRL_DATAWIDTH_BIT32                (_ECA_CAPTURECTRL_DATAWIDTH_BIT32 << 8)             /**< Shifted mode BIT32 for ECA_CAPTURECTRL      */
#define _ECA_CAPTURECTRL_DATAROTATESIZE_SHIFT          11                                                  /**< Shift value for ECA_DATAROTATESIZE          */
#define _ECA_CAPTURECTRL_DATAROTATESIZE_MASK           0xF800UL                                            /**< Bit mask for ECA_DATAROTATESIZE             */
#define _ECA_CAPTURECTRL_DATAROTATESIZE_DEFAULT        0x00000000UL                                        /**< Mode DEFAULT for ECA_CAPTURECTRL            */
#define ECA_CAPTURECTRL_DATAROTATESIZE_DEFAULT         (_ECA_CAPTURECTRL_DATAROTATESIZE_DEFAULT << 11)     /**< Shifted mode DEFAULT for ECA_CAPTURECTRL    */
#define ECA_CAPTURECTRL_STARTMODE                      (0x1UL << 16)                                       /**< Start Mode                                  */
#define _ECA_CAPTURECTRL_STARTMODE_SHIFT               16                                                  /**< Shift value for ECA_STARTMODE               */
#define _ECA_CAPTURECTRL_STARTMODE_MASK                0x10000UL                                           /**< Bit mask for ECA_STARTMODE                  */
#define _ECA_CAPTURECTRL_STARTMODE_DEFAULT             0x00000000UL                                        /**< Mode DEFAULT for ECA_CAPTURECTRL            */
#define _ECA_CAPTURECTRL_STARTMODE_MANUAL              0x00000000UL                                        /**< Mode MANUAL for ECA_CAPTURECTRL             */
#define _ECA_CAPTURECTRL_STARTMODE_START_TRIGGER       0x00000001UL                                        /**< Mode START_TRIGGER for ECA_CAPTURECTRL      */
#define ECA_CAPTURECTRL_STARTMODE_DEFAULT              (_ECA_CAPTURECTRL_STARTMODE_DEFAULT << 16)          /**< Shifted mode DEFAULT for ECA_CAPTURECTRL    */
#define ECA_CAPTURECTRL_STARTMODE_MANUAL               (_ECA_CAPTURECTRL_STARTMODE_MANUAL << 16)           /**< Shifted mode MANUAL for ECA_CAPTURECTRL     */
#define ECA_CAPTURECTRL_STARTMODE_START_TRIGGER        (_ECA_CAPTURECTRL_STARTMODE_START_TRIGGER << 16)    /**< Shifted mode START_TRIGGER for ECA_CAPTURECTRL*/
#define _ECA_CAPTURECTRL_STOPMODE_SHIFT                17                                                  /**< Shift value for ECA_STOPMODE                */
#define _ECA_CAPTURECTRL_STOPMODE_MASK                 0x60000UL                                           /**< Bit mask for ECA_STOPMODE                   */
#define _ECA_CAPTURECTRL_STOPMODE_DEFAULT              0x00000000UL                                        /**< Mode DEFAULT for ECA_CAPTURECTRL            */
#define _ECA_CAPTURECTRL_STOPMODE_CONTINUOUS           0x00000000UL                                        /**< Mode CONTINUOUS for ECA_CAPTURECTRL         */
#define _ECA_CAPTURECTRL_STOPMODE_BUF_FULL             0x00000001UL                                        /**< Mode BUF_FULL for ECA_CAPTURECTRL           */
#define _ECA_CAPTURECTRL_STOPMODE_STOP_TRIGGER         0x00000002UL                                        /**< Mode STOP_TRIGGER for ECA_CAPTURECTRL       */
#define _ECA_CAPTURECTRL_STOPMODE_STOP_TRIGGER_FULL    0x00000003UL                                        /**< Mode STOP_TRIGGER_FULL for ECA_CAPTURECTRL  */
#define ECA_CAPTURECTRL_STOPMODE_DEFAULT               (_ECA_CAPTURECTRL_STOPMODE_DEFAULT << 17)           /**< Shifted mode DEFAULT for ECA_CAPTURECTRL    */
#define ECA_CAPTURECTRL_STOPMODE_CONTINUOUS            (_ECA_CAPTURECTRL_STOPMODE_CONTINUOUS << 17)        /**< Shifted mode CONTINUOUS for ECA_CAPTURECTRL */
#define ECA_CAPTURECTRL_STOPMODE_BUF_FULL              (_ECA_CAPTURECTRL_STOPMODE_BUF_FULL << 17)          /**< Shifted mode BUF_FULL for ECA_CAPTURECTRL   */
#define ECA_CAPTURECTRL_STOPMODE_STOP_TRIGGER          (_ECA_CAPTURECTRL_STOPMODE_STOP_TRIGGER << 17)      /**< Shifted mode STOP_TRIGGER for ECA_CAPTURECTRL*/
#define ECA_CAPTURECTRL_STOPMODE_STOP_TRIGGER_FULL     (_ECA_CAPTURECTRL_STOPMODE_STOP_TRIGGER_FULL << 17) /**< Shifted mode STOP_TRIGGER_FULL for ECA_CAPTURECTRL*/
#define _ECA_CAPTURECTRL_COND_SHIFT                    20                                                  /**< Shift value for ECA_COND                    */
#define _ECA_CAPTURECTRL_COND_MASK                     0x300000UL                                          /**< Bit mask for ECA_COND                       */
#define _ECA_CAPTURECTRL_COND_DEFAULT                  0x00000000UL                                        /**< Mode DEFAULT for ECA_CAPTURECTRL            */
#define _ECA_CAPTURECTRL_COND_TIMED                    0x00000000UL                                        /**< Mode TIMED for ECA_CAPTURECTRL              */
#define _ECA_CAPTURECTRL_COND_START_TRIGGER            0x00000001UL                                        /**< Mode START_TRIGGER for ECA_CAPTURECTRL      */
#define _ECA_CAPTURECTRL_COND_SLAVE                    0x00000002UL                                        /**< Mode SLAVE for ECA_CAPTURECTRL              */
#define ECA_CAPTURECTRL_COND_DEFAULT                   (_ECA_CAPTURECTRL_COND_DEFAULT << 20)               /**< Shifted mode DEFAULT for ECA_CAPTURECTRL    */
#define ECA_CAPTURECTRL_COND_TIMED                     (_ECA_CAPTURECTRL_COND_TIMED << 20)                 /**< Shifted mode TIMED for ECA_CAPTURECTRL      */
#define ECA_CAPTURECTRL_COND_START_TRIGGER             (_ECA_CAPTURECTRL_COND_START_TRIGGER << 20)         /**< Shifted mode START_TRIGGER for ECA_CAPTURECTRL*/
#define ECA_CAPTURECTRL_COND_SLAVE                     (_ECA_CAPTURECTRL_COND_SLAVE << 20)                 /**< Shifted mode SLAVE for ECA_CAPTURECTRL      */
#define ECA_CAPTURECTRL_STOPCONDPRI                    (0x1UL << 22)                                       /**< Stop Condition Priority                     */
#define _ECA_CAPTURECTRL_STOPCONDPRI_SHIFT             22                                                  /**< Shift value for ECA_STOPCONDPRI             */
#define _ECA_CAPTURECTRL_STOPCONDPRI_MASK              0x400000UL                                          /**< Bit mask for ECA_STOPCONDPRI                */
#define _ECA_CAPTURECTRL_STOPCONDPRI_DEFAULT           0x00000000UL                                        /**< Mode DEFAULT for ECA_CAPTURECTRL            */
#define ECA_CAPTURECTRL_STOPCONDPRI_DEFAULT            (_ECA_CAPTURECTRL_STOPCONDPRI_DEFAULT << 22)        /**< Shifted mode DEFAULT for ECA_CAPTURECTRL    */
#define ECA_CAPTURECTRL_WRITEDIS                       (0x1UL << 23)                                       /**< Write Memory Disable                        */
#define _ECA_CAPTURECTRL_WRITEDIS_SHIFT                23                                                  /**< Shift value for ECA_WRITEDIS                */
#define _ECA_CAPTURECTRL_WRITEDIS_MASK                 0x800000UL                                          /**< Bit mask for ECA_WRITEDIS                   */
#define _ECA_CAPTURECTRL_WRITEDIS_DEFAULT              0x00000000UL                                        /**< Mode DEFAULT for ECA_CAPTURECTRL            */
#define ECA_CAPTURECTRL_WRITEDIS_DEFAULT               (_ECA_CAPTURECTRL_WRITEDIS_DEFAULT << 23)           /**< Shifted mode DEFAULT for ECA_CAPTURECTRL    */
#define ECA_CAPTURECTRL_DATAOUTEN                      (0x1UL << 24)                                       /**< Port Interface Enable                       */
#define _ECA_CAPTURECTRL_DATAOUTEN_SHIFT               24                                                  /**< Shift value for ECA_DATAOUTEN               */
#define _ECA_CAPTURECTRL_DATAOUTEN_MASK                0x1000000UL                                         /**< Bit mask for ECA_DATAOUTEN                  */
#define _ECA_CAPTURECTRL_DATAOUTEN_DEFAULT             0x00000000UL                                        /**< Mode DEFAULT for ECA_CAPTURECTRL            */
#define ECA_CAPTURECTRL_DATAOUTEN_DEFAULT              (_ECA_CAPTURECTRL_DATAOUTEN_DEFAULT << 24)          /**< Shifted mode DEFAULT for ECA_CAPTURECTRL    */
#define _ECA_CAPTURECTRL_DATAOUTDSHIFT_SHIFT           25                                                  /**< Shift value for ECA_DATAOUTDSHIFT           */
#define _ECA_CAPTURECTRL_DATAOUTDSHIFT_MASK            0x7E000000UL                                        /**< Bit mask for ECA_DATAOUTDSHIFT              */
#define _ECA_CAPTURECTRL_DATAOUTDSHIFT_DEFAULT         0x00000000UL                                        /**< Mode DEFAULT for ECA_CAPTURECTRL            */
#define ECA_CAPTURECTRL_DATAOUTDSHIFT_DEFAULT          (_ECA_CAPTURECTRL_DATAOUTDSHIFT_DEFAULT << 25)      /**< Shifted mode DEFAULT for ECA_CAPTURECTRL    */

